/* 
  Localizable.strings
  CoreSDKTestApp

  Created by Vladimír Nevyhoštěný on 10.11.15.
  Copyright © 2015 Applifting. All rights reserved.
*/

"err-other"                                  = "Other error.";
"err-empty-data"                             = "Empty data.";
"err-empty-password"                         = "Empty password.";
"err-decryption-failed"                      = "Data decryption failed.";
"err-encryption-failed"                      = "Data encryption failed.";
"err-parsing-data"                           = "Error parsing data.";
"err-no-panination-set"                      = "No pagination was set.";
"err-empty-clientid"                         = "Empty clientId.";
"err-wrong-oauth2-url"                       = "Wrong OAuth2 URL.";
"err-registration-failed"                    = "Registration failed.";
"err-login-failed"                           = "Login failed.";
"err-password-change-failed"                 = "User password change failed.";
"err-user-registration-failed"               = "User unregistration failed.";
"err-touchid-not-available"                  = "Touch ID is not defined, or unavailable.";
"err-empty-json"                             = "Empty JSON body.";
"err-otp-unlock-failed"                      = "Unlock with OTP failed.";
"err-operation-cancelled"                    = "Operation cancelled.";
"err-file-download-failed"                   = "File download failed.";
"err-attachment-upload-failed"               = "Attachment upload failed.";
"err-network-not-available"                  = "Network not available.";
"err-network-error"                          = "Network error. Please, try again later.";
"err-protected-data-not-available"           = "Protected data not available.";
"err-server-unavailable"                     = "An unexpected error occurred. Please try again later.";
"err-no-access-token"                        = "Missing access token.";
"err-no-refresh-token"                       = "Missing refresh token.";
"err-wrong-locker-data"                      = "Wrong locker data.";
"err-user-not-registered"                    = "User is not registered.";
"err-no-auth-token"                          = "Auth. token not found.";
"err-login-canceled"                         = "Login has been canceled.";
"err-wrong-lock-type"                        = "Wrong lock type.";
"err-wrong-locker-data"                      = "Wrong locker data.";
"err-user-not-registered"                    = "User is unregistered.";
"err-refresh-token-failure"                  = "Refresh token failure.";
"err-session-timeout"                        = "Login session timeout.";
"err-unsignable-entity"                      = "Unsignable entity.";
"err-signing-failed"                         = "Signing failed.";
"err-invalid-OTP"                            = "Invalid OTP.";
"err-invalid-authorization-type"             = "Invalid authorization type.";


"auth-method-pin"                            = "PIN code";
"auth-method-fingerprint"                    = "fingerprint";
"auth-method-gesture"                        = "gesture";
"auth-method-none"                           = "without security";

"lock-status-unregistered"                   = "unregistered";
"lock-status-locked"                         = "locked";
"lock-status-unlocked"                       = "unlocked";

